Repository: jintopia07/Project-mobile-application
Catalog: lib/l10n/app_*.arb
Languages: th

# language
source: English
th: ไทย

source: Hello World!
th: สวัสดี

# hello
source: Hello {username}
th: สวัสดี {username}

# homeMenu1
source: Contact information
th: ข้อมูลการติดต่อ

# homeMenu1detail
source: Contact details for the 10 central and provincial national archives
th: รายละเอียดข้อมูลการติดต่อหอจดหมายเหตุแห่งชาติส่วนกลางและส่วนภูมิภาคทั้ง 10 แห่ง

# homeMenu2
source: About the National Archives
th: เกี่ยวกับหอจดหมายเหตุแห่งชาติ

# homeMenu2detail
source: Introduce the rules, procedures, processes of using the service of the archival document service system for the people.
th: แนะนำระเบียบ ขั้นตอน กระบวนการ การใช้บริการระบบบริการเอกสารจดหมายเหตุเพื่อประชาชน

# homeMenu3
source: Request service for copying documents
th: บริการขอทำสำเนาเอกสาร

# homeMenu3detail
source: Introducing the process of requesting a copy of the National Archives documents online.
th: แนะนำขั้นตอน การขอทำสำเนาเอกสารจดหมายเหตุแห่งชาติแบบออนไลน์

# launcherMenu1
source: Home
th: หน้าแรก

# launcherMenu2
source: Searcher
th: ค้นหา

# launcherMenu3
source: Login
th: เข้าสู่ระบบ

# launcherUser1
source: Home
th: หน้าแรก

# launcherUser2
source: Searcher
th: ค้นหา

# launcherUser3
source: Order
th: สั่งซื้อ

# launcherUser4
source: Account
th: ข้อมูลผู้ใช้งาน

# tabmenuforuser1
source: Home
th: หน้าหลัก

# tabmenuforuser2
source: Searcher
th: สืบค้นเอกสาร

# tabmenuforuser3
source: In Basket Order
th: รายการขอทำสำเนา

# tabmenuforuser4
source: Copy request information
th: ข้อมูลการขอทำสำเนา

# tabmenuforuser5
source: In process
th: อยู่ระหว่างดำเนินการ

# tabmenuforuser6
source: Complete
th: ดำเนินการเรียบร้อยแล้ว

# tabmenuforuser7
source: Transaction history
th: ประวัติการทำรายการ

# tabmenuforuser8
source: Account
th: ข้อมูลสมาชิก

# tabmenuforuser9
source: About the National Archives
th: เกี่ยวกับหอจดหมายเหตุแห่งชาติ

# tabmenuforuser10
source: Request service for copying documents
th: บริการขอทำสำเนาเอกสาร

# tabmenuforuser11
source: Contact information
th: ข้อมูลการติดต่อ

# tabmenuforuser12
source: Log out
th: ออกจากระบบ

# titlehome
source: Home
th: หน้าแรก

# titlesearcher
source: Searcher
th: ค้นหาเอกสารหอจดหมายเหตุ

# titleselecteditem
source: Selected item
th: รายการที่เลือก

# titlenatinfo
source: Regional archives
th: หอจดหมายเหตุส่วนภูมิภาค

# titleaboutus
source: About the National Archives
th: เกี่ยวกับหอจดหมายเหตุแห่งชาติ

# titlepayment
source: Terms and Conditions of Service
th: ข้อกำหนดและเงื่อนไขการบริการ

# menusearcher1
source: Searcher
th: สืบค้น

# menusearcher2
source: Select an archive document type
th: เลือกประเภทเอกสารจดหมายเหตุ

# menusearcher3
source: Please enter a search term
th: กรุณากรอกคำค้นหาข้อมูล

# menusearcherdetail1
source: **In the case of multiple search terms Separate the search words with letters
th: **กรณีมีคำค้นหลายคำ ให้คั่นคำค้นด้วยตัวอักษร

# menusearcherdetail2
source: such as important people, Thailand, Rattanakosin
th: เช่น บุคคลสำคัญ,ประเทศไทย,รัตนโกสินทร์

# menusearcherbutton
source: Searcher
th: ค้นหา

# menusearcherbuttondetail
source: Detailed search
th: สืบค้นหาแบบละเอียด

# menusearcherfillin1
source: Document ID
th: รหัสเอกสาร

# menusearcherfillin2
source: Title
th: ชื่อเรื่อง

# menusearcherfillin3
source: Document owner agency
th: หน่วยงานเจ้าของเอกสาร

# menusearcherfillin4
source: Summary
th: สาระสังเขป

# menusearcherfillin5
source: Digital file name
th: ชื่อดิจิทัลไฟล์

# menusearcherfillin6
source: Year format
th: รูปแบบปี

# menusearcherfillin7
source: Please select
th: กรุณาเลือก

# menusearcherfillin8
source: Since
th: ตั้งแต่

# menusearcherfillin9
source: Please select
th: กรุณาเลือก

# menusearcherfillin10
source: To
th: ถึง

# menusearcherfillin11
source: Please select
th: กรุณาเลือก

# menusearcherfillin12
source: Agency
th: หน่วยงาน

# menusearcherfillin13
source: Please select
th: กรุณาเลือก

# menusearcherfillin14
source: Searcher
th: ค้นหา

# menusearchercount1
source: Number of documents in the system
th: จำนวนเอกสารในระบบ

# menusearchercount2
source: Written type archives :
th: จดหมายเหตุประเภทลายลักษณ์อักษร :

# menusearchercount3
source: Audiovisual Archives - Picture :
th: โสตทัศนจดหมายเหตุ-ภาพ :

# menusearchercount4
source: Map type archives :
th: จดหมายเหตุประเภทแผนที่ แผนผัง :

# menusearchercount5
source: Audiovisual Archives - Recording Strips :
th: โสตทัศนจดหมายเหตุ-แถบบันทึกภาพ :

# menusearchercount6
source: Audiovisual Archives - Recording Tapes :
th: โสตทัศนจดหมายเหตุ-แถบบันทึกเสียง :

# getsearchingoptionand
source: And
th: และ

# getsearchingoptionor
source: Or
th: หรือ

# menuorder1
source: Selected item
th: รายการที่เลือก

# menuorder2
source: Items pending approval
th: รายการที่รอการอนุมัติ

# menuorder3
source: Ready to pay items
th: รายการที่พร้อมจ่ายเงิน

# menuorder4
source: Completed payment
th: รายการที่ชำระเงินเรียบร้อย

# menuorder5
source: The list of files downloaded successfully
th: รายการที่ดาวน์โหลดไฟล์เรียบร้อยแล้ว

# dropdownlist1
source: Archival documents
th: เอกสารจดหมายเหตุลายลักษณ์

# dropdownlist2
source: Audiovisual documents
th: เอกสารโสตทัศน-ภาพ

# dropdownlist3
source: Audiovisual Documents - Recording Strips
th: เอกสารโสตทัศน-แถบบันทึกภาพ

# dropdownlist4
source: Audiovisual Documents - Recording Tapes
th: เอกสารโสตทัศน-แถบบันทึกเสียง

# dropdownlist5
source: Map, schematic, plan
th: แผนที่ แผนผัง แบบแปลน

# inforegional1
source: National Archives in Honor of His Majesty King Bhumibol Adulyadej
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติพระบาทสมเด็จพระเจ้าอยู่หัวภูมิพลอดุลยเดช

# inforegionaladd
source: Location
th: สถานที่ตั้ง

# inforegionaldetail1
source: Bang Khan - Khlong Luang Road, Khlong Ha Subdistrict, Khlong Luang District Pathum Thani Province 12120
th: ถนนสายบางขันธ์ – คลองหลวง ตำบลคลองห้า อำเภอคลองหลวง จังหวัดปทุมธานี 12120

# inforegionalphone
source: Telephone :
th: โทรศัพท์ :

# inforegionalfax
source: Fax :
th: โทรสาร :

# inforegionalmap
source: Map :
th: แผนที่ :

# inforegional2
source: National Archives in Honor of Her Majesty Queen Sirikit Her Majesty the Queen, Chiang Mai
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ เชียงใหม่

# inforegionalarea
source: Area of ​​responsibility
th: พื้นที่รับผิดชอบ

# inforegionalareadetail1
source: Chiang Mai, Chiang Rai, Lamphun and Mae Hong Son
th: เชียงใหม่ เชียงราย ลำพูน และแม่ฮ่องสอน

# inforegionaldetail2
source: Suthep Road, Mueang District, Chiang Mai Province 50200
th: ถนนสุเทพ อำเภอเมือง จังหวัดเชียงใหม่ 50200

# inforegional3
source: National Archives in Honor of Her Majesty Queen Sirikit Her Majesty the Queen, Trang
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ ตรัง

# inforegionalareadetail3
source: Trang, Krabi, Phang Nga, Phuket and Ranong
th: ตรัง กระบี่ พังงา ภูเก็ต และระนอง

# inforegionaldetail3
source: Nong Yuan Road, Thap Thiang Sub-district, Mueang District, Trang Province 92000
th: ถนนหนองยวน ตำบลทับเที่ยง อำเภอเมือง จังหวัดตรัง 92000

# inforegional4
source: National Archives in Honor of Her Majesty Queen Sirikit Her Majesty Queen Yala
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ ยะลา

# inforegionalareadetail4
source: Pattani, Yala and Narathiwat
th: ปัตตานี ยะลา และนราธิวาส

# inforegionaldetail4
source: No. 3, Tessaban 2 Road, Sateng Subdistrict, Mueang Yala District, Yala Province 95000
th: เลขที่ 3 ถนนเทศบาล 2 ตำบลสะเตง อำเภอเมืองยะลา จังหวัดยะลา 95000

# inforegionalemail
source: E-mail :
th: อีเมล :

# inforegional5
source: National Archives in Honor of Her Majesty Queen Sirikit The Queen of Songkhla
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระนางเจ้าสิริกิติ์ พระบรมราชินีนาถ สงขลา

# inforegionalareadetail5
source: Chumphon, Surat Thani, Nakhon Si Thammarat, Phatthalung, Songkhla and Satun
th: ชุมพร สุราษฎร์ธานี นครศรีธรรมราช พัทลุง สงขลา และสตูล

# inforegionaldetail5
source: In the area of ​​Hat Yai Municipal Park, Kajanavanich Road, Kho Hong Subdistrict, Hat Yai District, Songkhla Province 90110
th: ในบริเวณสวนสาธารณะเทศบาลนครหาดใหญ่ ถนนกาจนวนิช ตำบลคอหงส์ อำเภอหาดใหญ่ จังหวัดสงขลา 90110

# inforegional6
source: National Archives in Honor of HRH Princess Maha Chakri Sirindhorn Crown Prince Phayao
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระบรมโอรสาธิราชฯ สยามมกุฎราชกุมาร พะเยา

# inforegionalareadetail6
source: Lampang, Phayao, Nan, Phrae, Uttaradit, Sukhothai, Phitsanulok, Phichit, Kamphaeng Phet and Tak.
th: ลำปาง พะเยา น่าน แพร่ อุตรดิตถ์ สุโขทัย พิษณุโลก พิจิตร กำแพงเพชร และตาก

# inforegionaldetail6
source: Wat Phra That Chom Thong area Super Highway Road, Muang District, Phayao Province 56000
th: บริเวณวัดพระธาตุจอมทอง ถนนซุปเปอร์ไฮเวย์ อำเภอเมือง จังหวัดพะเยา 56000

# inforegional7
source: National Archives in Honor of HRH Princess Maha Chakri Sirindhorn Crown Prince Ubon Ratchathani
th: หอจดหมายเหตุแห่งชาติเฉลิมพระเกียรติสมเด็จพระบรมโอรสาธิราชฯ สยามมกุฎราชกุมาร อุบลราชธานี

# inforegionalareadetail7
source: Khon Kaen, Maha Sarakham, Loei, Nong Khai, Nong Bua Lamphu, Bueng Kan, Udon Thani, Roi Et, Kalasin, Sakon Nakhon, Nakhon Phanom, Ubon Ratchathani, Mukdahan, Yasothon, Sisaket, Amnat Charoen, Nakhon Ratchasima, Chaiyaphum, Buriram and Surin.
th: ขอนแก่น มหาสารคาม เลย หนองคาย หนองบัวลำภู บึงกาฬ อุดรธานี ร้อยเอ็ด กาฬสินธุ์ สกลนคร นครพนม อุบลราชธานี มุกดาหาร ยโสธร ศรีสะเกษ อำนาจเจริญ นครราชสีมา ชัยภูมิ บุรีรัมย์ และสุรินทร์

# inforegionaldetail7
source: Bypass Road, Chae Ramae Subdistrict, Mueang District, Ubon Ratchathani Province 34000
th: ถนนเลี่ยงเมือง ตำบลแจระแม อำเภอเมือง จังหวัดอุบลราชธานี 34000

# inforegional8
source: National Archives Suphanburi Province
th: หอจดหมายเหตุแห่งชาติ จังหวัดสุพรรณบุรี

# inforegionalareadetail8
source: Ratchaburi, Phetchaburi, Prachuap Khiri Khan, Samut Sakhon, Samut Songkhram, Suphan Buri, Kanchanaburi, Nakhon Pathom, Ayutthaya, Nakhon Nayok, Saraburi, Ang Thong, Sing Buri, Lopburi, Chainat, Phetchabun, Nakhon Sawan and Uthai Thani.
th: ราชบุรี เพชรบุรี ประจวบคีรีขันธ์ สมุทรสาคร สมุทรสงคราม สุพรรณบุรี กาญจนบุรี นครปฐม อยุธยา นครนายก สระบุรี อ่างทอง สิงห์บุรี ลพบุรี ชัยนาท เพชรบูรณ์ นครสวรรค์ และอุทัยธานี

# inforegionaldetail8
source: Suphan Buri-Chainat Road, Mueang District, Suphan Buri Province 72000
th: ถนนสุพรรณบุรี – ชัยนาท อำเภอเมือง จังหวัดสุพรรณบุรี 72000

# inforegional9
source: National Archives, Chanthaburi
th: หอจดหมายเหตุแห่งชาติ จันทบุรี

# inforegionalareadetail9
source: Chanthaburi, Trat, Rayong, Chonburi, Chachoengsao, Prachinburi and Sa Kaeo
th: จันทบุรี ตราด ระยอง ชลบุรี ฉะเชิงเทรา ปราจีนบุรี และสระแก้ว

# inforegionaldetail9
source: Chanthaburi's Old Town Hall, Liab Noen Road, Mueang District, Chanthaburi 22000
th: ศาลากลางเก่าจังหวัดจันทบุรี ถนนเลียบเนิน อำเภอเมือง จังหวัดจันทบุรี 22000

# inforegional10
source: Prime Minister's Archives General Prem Tinsulanonda
th: หอจดหมายเหตุนายกรัฐมนตรี พลเอก เปรม ติณสูลานนท์

# inforegionalareadetail10
source: Specific archives
th: หอจดหมายเหตุเฉพาะ

# inforegionaldetail10
source: Ratchadamnoen Road, Klang Subdistrict, Mueang District, Nakhon Si Thammarat Province 80000
th: ถนนราชดำเนิน ตำบลคลัง อำเภอเมือง จังหวัดนครศรีธรรมราช 80000

# inforegional11
source: H.E. Banharn Silpa-Archa, Thailand's 21st Prime Minister
th: หอเกียรติยศ ฯพณฯ บรรหาร ศิลปอาชา นายกรัฐมนตรี คนที่ ๒๑

# inforegionalareadetail11
source: The duty of collecting documents, including organizing exhibitions. History, works and items related to the mission of Mr. Banharn Silpa-archa, the 21st Prime Minister
th: หน้าที่รวบรวมเก็บรักษาเอกสารรวมทั้งการจัดนิทรรศการ ประวัติผลงานและสิ่งของที่เนื่องในภารกิจของนายบรรหาร ศิลปอาชา อดีตนายกรัฐมนตรี คนที่ ๒๑

# inforegionaldetail11
source: The area of ​​Suphan Buri Provincial Government Center (Don Yang Yae), Mueang Suphan Buri District Suphanburi Province 72000
th: บริเวณศูนย์ราชการจังหวัดสุพรรณบุรี (ดอนย่างแย้) อำเภอเมืองสุพรรณบุรี จังหวัดสุพรรณบุรี 72000

# headinforegional
source: Contact the regional archives
th: ติดต่อหอจดหมายเหตุส่วนภูมิภาค

# menuloginpage
source: Login
th: เข้าสู่ระบบ

# menuloginpages
source: Sign Up
th: สมัครสมาชิก

# menuloginuser
source: Username
th: ชื่อผู้ใช้งาน

# menuloginuserpassword
source: Password
th: รหัสผ่าน

# menuloginforgotpassword
source: Forgot your password
th: ลืมชื่อผู้ใช้งาน/รหัสผ่าน

# menuloginusernoaccount
source: Sign up for researchers don't have an account or login via Facebook,Google
th: ลงทะเบียนสำหรับผู้ค้นคว้าที่ยังไม่มีบัญชีผู้ใช้งาน หรือเข้าใช้งานผ่าน Facebook,Google

# menuregister
source: Register
th: ลงทะเบียน

# menuregisterpage
source: PLEASE SELECT YOUR REGISTRATION TYPE.
th: เลือกประเภทการลงทะเบียน

# menutitlelogin
source: LOGIN
th: เข้าสู่ระบบ
