// @dart=2.9
import 'package:flutter/material.dart';
import 'package:nat/constants.dart';
import 'package:flutter_gen/gen_l10n/app_localizations.dart';
import 'package:nat/widgets/language_picker_widget.dart';

class AboutUs extends StatefulWidget {
  const AboutUs({Key key}) : super(key: key);

  @override
  _AboutUsState createState() => _AboutUsState();
}

class _AboutUsState extends State<AboutUs> {
  @override
  Widget build(BuildContext context) {
    return WillPopScope(
      onWillPop: () async => true,
      child: Scaffold(
        appBar: AppBar(
          title: Text( AppLocalizations.of(context).titleaboutus),
          backgroundColor: Colors.teal[600],
           actions: [
            LanguagePickerWidget(),
            const SizedBox(width: 12),
          ],
        ),
        body: SingleChildScrollView(
          child: Stack(
            children: <Widget>[
              Padding(
                padding: const EdgeInsets.symmetric(
                    horizontal: defaultPadding * 8,
                    vertical: defaultPadding / 1),
                child: Container(
                  height: 320,
                  decoration: const BoxDecoration(
                    image: DecorationImage(
                      image: AssetImage("assets/images/p1.jpg"),
                      fit: BoxFit.cover,
                    ),
                  ),
                ),
              ),
              const SizedBox(
                height: defaultPadding,
              ),
              SafeArea(
                child: Padding(
                  padding: const EdgeInsets.only(
                    top: 330,
                  ),
                  child: Container(
                    margin: const EdgeInsets.all(defaultPadding),
                    padding: const EdgeInsets.symmetric(
                      horizontal: defaultPadding,
                    ),
                    child: Column(
                      crossAxisAlignment: CrossAxisAlignment.start,
                      children: const <Widget>[
                        SizedBox(height: defaultPadding),
                        Text(
                          "ประวัติ",
                          style: TextStyle(
                              color: Colors.teal, fontWeight: FontWeight.bold),
                        ),
                        SizedBox(height: defaultPadding),
                        Text(
                          "     งานจดหมายเหตุของประเทศไทย มีประวัติความเป็นมาสืบย้อนขึ้นไปได้ถึงสมัยกรุงศรีอยุธยาเป็นอย่างน้อย โดยอาศัยตามข้อทรงสันนิษฐานของสมเด็จพระเจ้าบรมวงศ์เธอ กรมพระยาดำรงราชานุภาพว่า 'เรื่องจดหมายเหตุมี ธรรมเนียมเก่าเป็นหน้าที่ของมหาดเล็กจะต้องจดบันทึกเหตุการณ์ต่าง ๆ เก็บไว้ในหอศาสตราคม และงานจดหมายเหตุ ในราชสำนักก็ยังเป็นประเพณีสืบต่อมาหลายสมัย ถึงสมัยกรุงรัตนโกสินทร์ ปรากฎหลักฐานเรื่องการจัดงบประมาณ กรมพระอาลักษณ์ เมื่อ ร.ศ. 115 ขอรับพระราชทานยกการบันทึกเหตุการณ์ประจำวัน รวมกับราชกิจจานุเบกษายก เป็นกองจดหมายเหตุ ใน ร.ศ. 118 ปรากฏหลักฐานประกาศตั้งตำแหน่งข้าราชการกรมรัฐมนตรีและกรมพระอาลักษณ์ มีหลวงนรราชจำนง ดำรงตำแหน่งปลัดกรมยังคงปรากฏมีกองจดหมายเหตุอยู่",
                        ),
                        SizedBox(
                          height: defaultPadding,
                        ),
                        Text(
                            '   ส่วนหอจดหมายเหตุ ในความหมายที่เป็นหน่วยงานเก็บเอกสารหรือเอกสารจดหมายเหตุ ตรงกับคำว่า ARCHIVES ในภาษาอังกฤษ มิใช่เพียงแต่หมายถึงการจดบันทึกเหตุการณ์ประจำวันที่เกิดขึ้นแล้วเก็บไว้นั้นเริ่มในสมัย กรุงรัตนโกสินทร์ พระบาทสมเด็จพระจุลจอมเกล้าเจ้าอยู่หัว ทรงเล็งเห็นความสำคัญของหนังสือราชการเป็นอย่างยิ่ง และมีพระราชกระแสให้นำเอกสารสำคัญไปเก็บรักษาไว้ในหอจดหมายเหตุ ดังตัวอย่างพระราชกระแสที่จะอัญเชิญ ต่อไปนี้ "เรื่องตราเปนอันได้ความถูกต้องตามที่พระยามหาอำมาตยแจ้งความ แต่มีความเสียใจที่เปนตราแกะใหม่ทั้ง 2 ดวง รุ่นเดียวกันกับนารายน์ทรงราหู ตราเก่าเปนจะหายหกตกหล่นเพราะเจ้าแผ่นดินไม่ได้อยู่ติดเมืองสักคนหนึ่ง ศุภอักษรนี้ อ่านคันใจเตมที เพราะเข้าใจโดยมาก ด้วยเปนคำมคธคำไทยเจืออยู่ แต่คำเขมรไม่เข้าใจเลย ขอให้ล่ามเขมรเขียนอักษร ขอมบรรทัดหนึ่ง อักษรไทยอ่านเปนสำเนียงเขมรบรรทัดหนึ่ง คำแปลภาษาเขมร เขียนลงไว้ใต้คำเขมรที่เขียนอักษรไทย หนังสือชนิดนี้ควรจะเข้าอาไคฟ ขอให้เก็บให้จงดี"'),
                        SizedBox(
                          height: defaultPadding,
                        ),
                        Text(
                            '   นอกจากนั้น สมเด็จพระเจ้าบรมวงศ์เธอ กรมพระยาดำรงราชานุภาพ พระบิดาแห่งประวัติศาสตร์ไทย   ผู้ทรงสนพระทัยการศึกษาค้นคว้าวิจัยได้ทรงเล็งเห็นความสำคัญของหนังสือราชการว่า จะเป็นเอกสารข้อมูลทาง ประวัติศาสตร์ ทรงห่วงใยว่าเอกสารเหล่านี้จะสูญหาย จึงทรงดำริจัดตั้งหอจดหมายเหตุและหอรูปขึ้น เพื่อเก็บรักษา เอกสารที่มีอายุเกิน 25 ปี และรูปถ่ายไว้ให้คนรุ่นหลังได้ศึกษาค้นคว้า ดังปรากฏในพระนิพนธ์ของหม่อมเจ้าพูนพิศมัย ดิสกุล ว่า งานจดหมายเหตุเป็นที่ยอมรับในความสำคัญ จึงจัดตั้งหน่วยงานขึ้นรับผิดชอบดำเนินการโดยเฉพาะ ท่านตรัสว่า "เราหาหนังสือหลักฐานทางราชการในสมัยก่อน ๆ ลำบากอยู่แล้ว ฉะนั้น ถ้าเริ่มต้นเสียแต่บัดนี้ ในเวลาอีก 100 - 200 ปี เด็ก ๆ จะแต่งหนังสือเรื่องอะไรก็จะหาหลักฐานได้จากหอนี้ ไม่ต้องลำบากเหมือนคนชั้นพ่อ" ข้าพเจ้าทูลถามว่า "จะเอา หนังสือมาจากไหน" ท่านตอบว่า "สั่งไปตามกระทรวงว่าหนังสืออะไรที่พ้น 25 ปี แล้วให้ส่งเข้าหอนี้ เราจ้างเด็กผู้หญิง (เพราะรายจ่ายต่ำด้วยไม่ใช่หัวหน้าครอบครัว) ด้วยเงินเดือนน้อย มาเป็นผู้เลือกปี เลือกเรื่อง เข้าแฟ้ม เรื่อยไป ในไม่ช้า เราก็จะได้เรื่องติดต่อกันมาเป็นหลักฐาน"'),
                        SizedBox(
                          height: defaultPadding,
                        ),
                        Text(
                            '   การดำเนินงานจดหมายเหตุในระยะแรกมีขึ้นเมื่อ พ.ศ. 2459 เป็นแผนกจดหมายเหตุอยู่ในหอพระสมุด  วชิรญาณ มีเอกสาร 2 ประเภท คือ เอกสารจดหมายเหตุในอดีตได้มาจากหนังสือที่หอพระสมุดวชิรญาณมีอยู่เดิม   ส่วนที่หาเพิ่มได้มาจากหนังสือท้องตราและใบบอกราชการหัวเมืองตั้งแต่รัชกาลที่ 4 ขึ้นไป ซึ่งขอจากกระทรวงมหาดไทยและกระทรวงต่าง ๆ ส่วนเอกสารจดหมายเหตุในปัจจุบัน ให้กระทรวงต่าง ๆ ส่งบรรดาคำสั่ง ข้อบังคับ   หรือรายงานที่กระทรวงนั้น ๆ จัดพิมพ์ขี้นมาให้หอพระสมุดวชิรญาณเก็บรักษาไว"'),
                        SizedBox(
                          height: defaultPadding,
                        ),
                        Text(
                            '   งานจดหมายเหตุเป็นที่ยอมรับในความสำคัญและจัดตั้งหน่วยงานขึ้นรับผิดชอบดำเนินการโดยเฉพาะ เมื่อมี ประกาศพระราชกฤษฎีกาจัดวางระเบียบราชการกรมศิลปากร ในวันที่ 18 สิงหาคม พ.ศ. 2495 ตั้งกองจดหมายเหตุ แห่งชาติขึ้น การดำเนินงานจดหมายเหตุได้พัฒนาและขยายขอบข่ายการปฏิบัติงานออกไปอย่างกว้างขวาง มีการ ปรับปรุงโครงสร้างขององค์กรให้ทันสมัย เพื่อก้าวไปสู่การดำเนินงานที่ตรงตามมาตรฐานวิชาการจดหมายเหตุสากล รวมทั้งขยายเครือข่ายหอจดหมายเหตุแห่งชาติในส่วนภูมิภาค ตั้งแต่ พ.ศ. 2536 เป็นต้นมา ปัจจุบัน จากนโยบายการ ปฏิรูประบบราชการ หอจดหมายเหตุแห่งชาติ มีฐานะเป็นสำนักหนึ่ง สังกัดกรมศิลปากร กระทรวงวัฒนธรรม"'),
                        SizedBox(height: defaultPadding * 1.5),
                      ],
                    ),
                  ),
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
